import os

# Токен и ID админа (Берем из переменных окружения для безопасности)
# Если запускаешь локально, можно оставить строку в кавычках
BOT_TOKEN = os.getenv("BOT_TOKEN", "8204017321:AAGepYmuggdM_WHodywL8_DaKa2k4oGUaf8")
ADMIN_ID = int(os.getenv("ADMIN_ID", 5500020741))

# Ссылка на Adsgram
ADSGRAM_URL = "https://tox-word.github.io/my-ads/"

# --- НАСТРОЙКИ ЭКОНОМИКИ ---
MIN_WITHDRAW = 200        # Минималка для вывода (в звездах)
AD_REWARD = 0.5           # Награда за 1 просмотр видео

# Настройки реферальной системы (2 уровня)
REF_L1_BONUS = 0.15       # 15% от приглашенного напрямую
REF_L2_BONUS = 0.10       # 10% от приглашенного твоим рефералом

# Курс (просто текст для профиля)
EXCHANGE_RATE = "100 ⭐ = 1.5$"

# Обязательная подписка (ОП)
# ВАЖНО: Бот должен быть админом в этих каналах!
REQUIRED_CHANNELS = ["@твой_канал_1", "@твой_канал_2"]
